[
    {
        "heading": "Jurgen Klopp reveals Alisson return timeline",
        "time": "2024-03-28T11:00:03Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht266whbw79dyfndsj.jpg",
        "content": "Liverpool manager Jurgen Klopp has revealed he expects goalkeeper Alisson to be back from his hamstring injury before the end of April. Alisson has been sidelined since February after picking up the muscular issue which also forced him to miss the latest international break with Brazil. During a meeting with fans at the club's AXA Training Centre, Klopp was asked for an update on Alisson's return to the team and the boss freely revealed that the 31-year-old is nearing a comeback. \"About two and a half, three weeks,\" Klopp said. \"It's not that long anymore, like Diogo [Jota] as well.\" It's not clear whether Klopp was referring to Alisson's return to training or to matchday action, but the Liverpool stopper can be expected back in the starting lineup by the end of April. Liverpool will face Brighton & Hove Albion on their return to Premier League action on March 31 before meetings with Sheffield United and Manchester United in the first week of April. Crystal Palace, Fulham, Everton and West Ham United are all on the schedule before May, with Alisson likely back to face the Toffees in the Merseyside derby on April 24. In the UEFA Europa League, the first leg of Liverpool's quarter-final with Atalanta will take place on April 11, with Alisson certain to miss out, but a speedy recovery process may see him in contention for the return leg on April 18 if everything goes perfectly. Midfielder Curtis Jones is expected back from injury for the Brighton game this weekend, but Trent Alexander-Arnold and Diogo Jota also face a few more weeks on the sidelines before getting back in action.",
        "link": "https://www.90min.com/posts/jurgen-klopp-reveals-alisson-return-timeline"
    },
    {
        "heading": "Man Utd & Liverpool join forces in bid to combat tragedy chanting",
        "time": "2024-03-28T10:30:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht24z7cmwq75fjmctf.jpg",
        "content": "Manchester United and Liverpool have joined forces in a bid to combat a recent rise in tragedy chanting. Both clubs, as well as local police forces, have urged fans of all teams to end taunts related to catastrophic events like the Munich Air Disaster or the Hillsborough Stadium disaster - two tragedies which impact United and Liverpool directly. Arrests were made following reports of tragedy chants during Man Utd's 4-3 win over Liverpool in the FA Cup quarter-final earlier this month, and with the two sides set to meet again in the Premier League in early April, both clubs have come together to try and put an end to tragedy chanting. The Manchester United Foundation and the LFC Foundation recently held a session with schoolchildren from Manchester and Liverpool to inform them of the severity of the tragedies and the impact they have had on the wider community. There are plans to work with the Premier League to make this an annual event to support tens of thousands of young people. John Shiels, CEO of Manchester United Foundation, said: \"It is unacceptable to use the loss of life, in relation to any tragedy, to score points, and it is time for it to stop. \"We are proud to come together with LFC Foundation as we believe education will break the generational cycle on this issue and help thousands of young people across this region understand the impact tragedy-related abuse has.\" Matt Parish, CEO of LFC Foundation, added: \"This is a hugely important event which both clubs are committed to making happen every year. \"Our two proud Foundations coming together to show young people, and all others, how we stand united against tragedy chanting is a very powerful message. Education is key, alongside appropriate action, to eradicating vile tragedy chanting in all its forms forever, and we're delighted to be able do our bit to help.\"",
        "link": "https://www.90min.com/posts/man-utd-liverpool-join-forces-bid-combat-tragedy-chanting"
    },
    {
        "heading": "Football transfer rumours: Liverpool consider Alexander-Arnold swap; Barcelona confident over Haaland signing",
        "time": "2024-03-28T09:15:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/voltaxMediaLibrary/mmsport/90min_en_international_web/01ht24e07dbr4rjncnk6.jpg",
        "content": "90min rounds up the latest transfer news, rumours and gossip circulating around the world... Liverpool have submitted an official proposal to sign Real Madrid winger Rodrygo this summer. (El Nacional - Spain) Liverpool have also considered using right-back Trent Alexander-Arnold as part of their bid to bring Rodrygo to Anfield. (Defensa Central - Spain) Scouts from Manchester United have recently been sent to Spain to observe Real Madrid forward Joselu, who will join Los Blancos permanently this summer for €1.5m when his loan from Espanyol expires. (Relevo - Spain) Leaving Man Utd this summer will be midfielder Christian Eriksen, who is free to depart after losing his place to Kobbie Mainoo. (Football Insider) Joshua Kimmich has an agreement with Bayern Munich over a summer exit. Bids of €65m (£56m) will be accepted. (El Nacional - Spain) Arsenal have matched Chelsea's €60m (£51m) bid for Sporting CP centre-back Ousmane Diomande, who is also of interest to Bayern Munich and Newcastle United. (Record - Portugal) Also on Arsenal's wish list is AC Milan midfielder Ismael Bennacer, who they sold in 2017. A fee of €50m (£43m) is expected to be enough to get a deal done. (Calciomercato.it - Italy) Jorginho is losing patience with his uncertain future at Arsenal and is being eyed by Barcelona, who hope to sign him on a free transfer this summer. (SPORT - Spain) Barcelona are growing in confidence about their chances of signing Manchester City striker Erling Haaland in 2025, with some at the club already certain the Norway international will be at Camp Nou in 18 months. (Jota Jordi - Spain) Tottenham Hotspur are interested in re-signing Sporting CP winger Marcus Edwards, who is valued at over €20m (£17m). Crystal Palace are also chasing the 25-year-old's signature. (A Bola - Portugal) Arsenal have a list of ten potential striker targets for the summer window, including RB Leipzig's Benjamin Sesko, Sporting CP's Viktor Gyokeres and Newcastle's Alexander Isak. (Mirror) Pep Guardiola is \"obsessed\" by the idea of bringing Newcastle midfielder Bruno Guimaraes to Manchester City but would have to pay a fee of €100m (£86m) to get a deal over the line. (Fichajes - Spain) Tottenham want Feyenoord's Santiago Gimenez as their long-term replacement for striker Harry Kane. (CaughtOffside) Juventus winger Samuel Iling-Junior, formerly of Chelsea, is being eyed by Brighton, Everton, Tottenham and West Ham. (Football Insider)",
        "link": "https://www.90min.com/posts/football-transfer-rumours-liverpool-alexander-arnold-swap-barcelona-confident-haaland"
    },
    {
        "heading": "Atalanta send warning to Liverpool & Juventus over Teun Koopmeiners transfer",
        "time": "2024-03-28T00:00:01Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0bnx21dwhjnhc8mq.jpg",
        "content": "Atalanta director Luca Percassi has insisted that the club \"does not need to sell\" star midfielder Teun Koopmeiners amid Liverpool and Juventus interest. The Dutch international has been one of the standout performers in Italy for the best part of the last 18 months, bagging an impressive 22 goals and eight assists in all competitions during that period. Percassi has insisted in an interview with L'Eco di Bergamo that the midfielder hasn't asked to be sold, despite Koopmeiners himself recently stating that was the case. \"This club is solid and does not need to sell,\" the Atalanta official said. \"Koopmeiners has not been sold to Juve, nor anyone else. In fact, he never asked us to be sold.\" Koopmeiners' form has led to plenty of speculation over his long term future in Bergamo, with 90min reporting that Liverpool were among the teams scouting the talented 26-year-old. The player himself has previously acknowledged links with the Anfield giants: \"I saw the links and stories about Liverpool. It's nice to see.\" Speaking in a recent interview with De Telegraaf, Koopmeiners gave the biggest hint yet regarding where his future lies, revealing that he has told Atalanta that he intends to leave the club during the upcoming transfer window. \"I told Atalanta that next summer I want to leave,\" he said. \"Already last year there was a concrete interest from Napoli but in the end, the clubs couldn't find an agreement. \"My girlfriend and I love life in Italy, but for some clubs in England, I'd be willing to tolerate the rain! I hope that options arise that I can reflect on. And I also hope that Atalanta receives a good sum, because I had a wonderful time in Bergamo.\"",
        "link": "https://www.90min.com/posts/atalanta-warning-liverpool-juventus-teun-koopmeiners-transfer"
    },
    {
        "heading": "Man City handed huge injury boost ahead of Arsenal clash",
        "time": "2024-03-28T00:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0qwv65tph1tyj4dd.jpg",
        "content": "Manchester City midfielder Kevin De Bruyne could be fit in time to face Arsenal in the huge Premier League title clash at the Etihad Stadium on Sunday afternoon. De Bruyne missed City's FA Cup quarter-final win over Newcastle United earlier this month with a groin injury and subsequently didn't link up with the Belgium squad for their matches against Republic of Ireland and England during the international break. But ESPN has reported there is \"optimism\" at City about De Bruyne being available for the Arsenal game. With most of the club's senior stars away, the 32-year-old is said to have come through a training session with the Under-23 squad on Tuesday unscathed. By the time those who have been representing their various national teams begin reporting back for training on Thursday, De Bruyne is set to join them. That will give the Belgian up to three daily sessions to prove his fitness before matchday comes on Sunday. De Bruyne saw the early months of his 2023/24 season ravaged by a hamstring injury suffered just 23 minutes into City's Premier League opener against Burnley back in early August. It was the best part of five months before he played again, missing the whole Champions League group stage and FIFA Club World Cup, only to pick up a groin strain only 12 appearances into his comeback. City trail Premier League leaders Arsenal by one point ahead of the weekend. Liverpool are also sandwiched between them, level on points with the Gunners but pushed into second place as a result of a slightly inferior goal difference. With just ten games each left to play, it is developing into perhaps the best Premier League title race there has ever been as genuine three-horse races have been virtually non-existent in the past.",
        "link": "https://www.90min.com/posts/man-city-huge-injury-boost-arsenal-clash-march-2024"
    },
    {
        "heading": "4 takeaways from March international break: Endrick the superstar, Germany's revival & more",
        "time": "2024-03-28T00:00:01Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/voltaxMediaLibrary/mmsport/90min_en_international_web/01hszxtt5gnqnwanjmyp.jpg",
        "content": "While many dread the international break and the subsequent lack of club football, there is one thing the March break proved good for: weighing up how teams may perform in upcoming tournaments. There were some surprise results this month, as some of the biggest nations in the world went head to head for some good old 'friendly' football. Germany impressed with two wins, whereas England went without a victory. Without further ado, here are 90min's four takeaways from the March internationals. It's hard to believe this star is just 17 years old, but the world has now been given their first taste of Endrick and it certainly won't be the last we see of him. He scored the only goal of the game at Wembley against the Three Lions and then confessed his admiration for legend Sir Bobby Charlton, capturing the hearts of football fans everywhere. Both his performances were outstanding during the break, but his real moment came when he bagged a goal just five minutes into his Santiago Bernabeu debut. He's set to arrive at Real Madrid in summer, so expect that goal to be his first of many in the famous old stadium. Another youngster bursting with talent, Lamine Yamal deserved a goal after his impeccable performances for Spain against both Colombia and Brazil. He won his sixth cap for his country when facing Brazil on Tuesday, and then received a standing ovation as he left the Bernabeu - a gesture that doesn't happen often, particular when you're on the books at Barcelona. After these outings, Yamal has to be starting in Spain's attack for Euro 2024. Germany established themselves as a force to be reckoned with before they host Euro 2024 in summer. Wins over both Spain and Netherlands signified a potential revival under new boss Julian Nagelsmann. The team lacks a world class striker, sure, but Niclas Fullkrug does have a good record for the nation. Goals also came from Florian Wirtz, Kai Havertz and Maximilian Mittelstadt proving that there are plenty of routes to goal for the current Germany side. Their recent tournament have been are pretty dire, but it seems that Die Mannschaft might finally be turning a corner. England have the talent, the experience and the skill to win Euro 2024. Their performances during the break didn't show that, but they were without key players that largely impact their games. There's a chance we'll all be singing 'Southgate you're the one' in a few months time, at least throughout the group stages. However, Gareth Southgate's side still have a poor record in big games against strong opposition, adding the loss to Brazil and draw with Belgium to that tally. They have arguably the most exciting selection of attackers in the world, and will need to pull out all the stops if they are to finally win a major tournament this summer.",
        "link": "https://www.90min.com/posts/takeaways-match-international-break-endrick-superstar-germany-revival"
    },
    {
        "heading": "'Don't give up hope' - Luis Diaz's father makes Madrid transfer admission",
        "time": "2024-03-27T16:00:05Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0756h1rf5gy0syep.jpg",
        "content": "Luis Diaz's father has opened the door to a future move to Spain for the Liverpool forward, revealing he hopes his son plays in La Liga one day. Diaz joined the Reds in the 2022 January transfer window and helped the club to FA Cup and Carabao Cup successes in his first half-season at Anfield, also starting the 1-0 Champions League final defeat to Real Madrid that year. The Colombia international has been linked with a move away from Merseyside, with rumours suggesting Paris Saint-Germain are interested in luring him to Parc des Princes. His dad, Luis Manuel, however, has hinted the 27-year-old may move to La Liga in the future. He said: \"When he left Porto I was not aware that there was anything positive with Madrid clubs. I heard things, but I never knew if there was anything else. With Liverpool everything was more precise. \"The directive was more precise for Luis to arrive there. It was hoped that he could come here [to Spain]. Radamel Falcao had already been there, James Rodriguez too...in the end it didn't happen, but don't give up hope yet. He is playing and the clubs are active.\" Luis Manuel previously revealed his son has dreamed of a move to Barcelona, having supported the Catalan giants since he was a child, though also thanked Liverpool and former club Porto for guiding the winger throughout his senior career so far. He said: \"The truth is that I know very little about Barcelona at the moment. It is true that Luis is a loyal Barcelona fan and it would be his dream to go there. So far I would like to thank Porto and Liverpool for the way they welcomed him and received him. \"Luis is a player who finds it easy to win over because of the way he is, because of his humility, his work, his dedication, he is a very disciplined player, thank God. There would be no problem if Luis came to Barcelona because it is a top team and one of the best in the world.\" Diaz's current Liverpool contract still has over three years left to run, having scored 22 goals in 86 appearances for the Reds.",
        "link": "https://www.90min.com/posts/dont-give-up-hope-luis-diaz-father-madrid-transfer-admission"
    },
    {
        "heading": "Chelsea secure place in Women's Champions League semi-finals",
        "time": "2024-03-27T22:01:51Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0tnr1a7867b114cg.jpg",
        "content": "Chelsea are into the Women's Champions League semi-finals for the fifth time in seven seasons as Emma Hayes seeks to land the ultimate prize in club football before departing to take charge of the United States women’s national team this summer. With Chelsea currently leading the WSL, set to contest the Conti Cup final on Sunday and then the FA Cup semi-finals in mid-April, the dream of a quadruple remains within Hayes' grasp. The rotated Blues successfully saw off Ajax in their quarter-final tie, drawing 1-1 on the night after already doing the bulk of the work with a 3-0 first leg victory in Amsterdam a week ago. Chelsea were defensively shaky in the early stages at Stamford Bridge and could have seen their aggregate lead cut into on a few occasions, notably when Romee Leuchter missed a glorious chance and then as Tiny Hoekstra charged down a clearance from goalkeeper Zecira Musovic. Any growing nerves from those on the pitch, in the dugout and in the stands were eased when Mayra Ramirez, potentially the world’s most expensive player if all the add-ons included in her £425,000 transfer from Levante are met, calmly finished from Guro Reiten's pass. That goal took the tie beyond Ajax, but the Dutch visitors still sensed blood and the potential for a famous result at Stamford Bridge. Chasity Grant was the grateful recipient of some more suspect goalkeeping from Musovic, back in the side after losing her usual starting place earlier this season, when a tame finish slipped through the Swede's hands. As it happens, Musovic made a world class save 15 minutes later to deny Ajax the lead on the night, acrobatically tipping Leuchter's curling finish wide of the far post. She seemed determined not to let the visitors past her again and another stunning save at the end kept out substitute Danique Tolhoek. Hayes won this competition during its UEFA Women's Cup guise while an assistant coach at Arsenal back in 2007. But it remains the only trophy missing from the trophy cabinet she has built at Chelsea, coming closest in 2021 when her team reached the final, only to be demolished 4-1 by Barcelona. With the full knockout bracket mapped out when the quarter-final draw was made, Chelsea are expected to face Barcelona in the last four. The reigning European champions have not yet secured their semi-final place but hold a 2-1 aggregate lead over Norwegian side SK Brann ahead of Thursday night’s second leg at the Johan Cruyff Stadium. Brann did incredibly well to frustrate the likes of Aitana Bonmati and Caroline Graham Hansen, but Barca are heavy favourites at home. Eight-time Champions League winners Lyon have booked their place in the other semi-final after a 6-2 aggregate win over Benfica. They will meet domestic rivals Paris Saint-Germain or Swedish side BK Hacken in the last four, with PSG leading that tie 2-1 ahead of Thursday’s decisive leg in France. This season’s final will be staged at the 53,000-capacity San Mames in Bilbao on Saturday 25 May. Last season’s final between Barcelona and Wolfsburg, watched by 33,147 fans at Philips Stadion in Eindhoven, was the first time the showpiece event had sold out its host venue, while the record attendance for a final is 50,212 when Lyon beat FFC Frankfurt at Munich’s Olympiastadion in 2012.",
        "link": "https://www.90min.com/posts/chelsea-secure-place-womens-champions-league-semi-finals-27-3-24"
    },
    {
        "heading": "Real Madrid learn extent of Eduardo Camavinga injury on international duty",
        "time": "2024-03-27T18:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0c883wynahxjq45r.jpg",
        "content": "Real Madrid are relieved to learn that Eduardo Camavinga suffered only a minor injury when the midfielder was forced off in the first half of France's 3-2 win over Chile on Tuesday. Camavinga was in visible discomfort when he limped out of the game in the 44th minute, replaced by Matteo Guendouzi. With the tough tackling 21-year-old a starter for Madrid and the first leg of the Champions League quarter-final against Manchester City on the horizon early next month, there had been concerns over his condition and if it might rule him out of upcoming games. But after early reports of a sprained ankle and more tests required, those fears have now been allayed. After the player reported back to Valdebebas on Wednesday, AS writes that it can be considered only a \"simple sprain\" and is not expected to result in Camavinga missing any games. He is set to do special recovery work with the physios and medical staff on Thursday and, all being well, should rejoin the rest of the squad for full training on Friday. As a result, Camavinga is tipped to be involved when Madrid host Athletic Club in La Liga on Sunday night, with no problems predicted ahead of the City game at the Bernabeu nine days after that. Camavinga is the long-term future of Madrid's midfield alongside Jude Bellingham, 20, Aurelien Tchouameni, 24, and Arda Guler, 19. But the latest on 34-year-old Toni Kroos is that he intends to stay for at least one more season amid reports he will extend his contract until 2025. There were murmurings that Kroos, who reversed his international retirement to play his first games for Germany in three years this month, could hang up his boots after playing at Euro 2024 on home soil. But the veteran's decision to continue his career is a huge boost to Madrid.",
        "link": "https://www.90min.com/posts/real-madrid-learn-extent-eduardo-camavinga-injury"
    },
    {
        "heading": "Liverpool star reacts to scoring first international goal",
        "time": "2024-03-27T15:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszs88hn4a0m80j6bc.jpg",
        "content": "Liverpool starlet Conor Bradley described his first international goal for Northern Ireland as a \"dream come true\" after netting the winner against Scotland at Hampden Park. Due to Trent Alexander-Arnold's injury concerns, Bradley has recently become a regular for Liverpool at club level, thoroughly impressing fans and pundits alike with his consistently solid performances on the right-hand side of Jurgen Klopp's defence. But the full-back has actually been well-versed in senior international football for a while, lining up for Northern Ireland for the 15th time in their friendly clash with Scotland on Tuesday evening. Capitalising on an error in defence from Scotland, Bradley was able to mark his latest appearance with his first ever goal for his national team, curling beautifully into the bottom right corner of the net to secure an impressive win for Michael O'Neill's side. Speaking about his goal, the youngster admitted that it was the stuff of dreams. \"I'm over the moon. I've been dreaming for quite a while about scoring my first international goal,\" said Bradley. \"I don't think in any of my dreams it was that good a goal but I'm buzzing and very happy we got the win. \"It's massive for our confidence as a team. It was a difficult [Euro 2024 qualifying] campaign the last time, so for us to go out there and beat a really good Scotland team full of Premier League players was really good and can only help us. \"I remember we lost the ball and I tried to win it back as quickly as I could and it came to my feet and I took a touch and the whole far corner just opened up for me. I thought 'why not just have a strike' and I took the strike. It took a little nick and went in the top corner. Sometimes you need a bit of luck on your side and thankfully I got that. \"It was brilliant that the fans were right beside me in the corner so it was quite a short distance for me to go and do a knee slide in front of them. That was special. The support from the fans tonight was just outstanding. I thought they were with us all the well through the game. They were unbelievable.\" Bradley is expected to keep his place in the Liverpool lineup this weekend when the Reds welcome Brighton & Hove Albion to Anfield on Sunday afternoon.",
        "link": "https://www.90min.com/posts/liverpool-star-reacts-scoring-first-international-goal"
    },
    {
        "heading": "Chelsea confirm summer signing set to miss rest of the season with injury",
        "time": "2024-03-27T14:40:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht01053g9t28czjgr2.jpg",
        "content": "Chelsea have confirmed midfielder Romeo Lavia will miss the remainder of the 2023/24 season due to injury. Lavia was one of many signings made by Chelsea during the 2023 transfer window, with the Belgium international turning down advances from Liverpool to make a £58m move to Stamford Bridge. Since leaving Southampton, however, things haven't gone to plan for Lavia. The midfielder missed the first four months of the 2023/24 season with an ankle injury suffered in training back in September and, following just 32 minutes of Premier League action, he once again limped off with a muscle ailment in a win over Crystal Palace at the end of December. Lavia has been out of action ever since and, following a recent assessment of his recovery, the club have confirmed he will be out of action for the remainder of the current campaign. Their statement reads: \"Midfielder Romeo Lavia is to unfortunately miss the remainder of our 2023/24 campaign following a setback in his recovery. \"Recent medical assessments have confirmed that Lavia, who sustained a significant thigh injury against Crystal Palace back in December, will not feature again this season.\" Mauricio Pochettino's side have dealt with a myriad of injury concerns throughout the season, leading to huge underperformance in the Premier League. The Blues are currently rooted in mid-table despite spending around £1bn on new players in recent years. On top of Lavia's absence, Chelsea are set to be without Wesley Fofana, captain Reece James and Christopher Nkunku for this weekend's clash with Burnley at Stamford Bridge, while Malo Gusto, Levi Colwill, Lesley Ugochukwu, Cole Palmer and Carney Chukwuemeka are all also doubts with various ailments.",
        "link": "https://www.90min.com/posts/chelsea-confirm-summer-signing-miss-rest-season-injury"
    },
    {
        "heading": "Gareth Southgate defends playing John Stones despite injury",
        "time": "2024-03-27T14:30:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszqcnx2ecf1wdspnz.jpg",
        "content": "Gareth Southgate has defended his decision to start John Stones in England's draw with Belgium after the Manchester City star hobbled of with an injury. Stones was forced off after just ten minutes of the friendly at Wembley Stadium on Tuesday evening due to an adductor issue, being replaced by Liverpool's Joe Gomez in the heart of England's defence. Having played 90 minutes of the friendly defeat to Brazil and considering Stones' injury issues throughout the 2023/24 season so far - he's missed 12 games due ailments, it came as a surprise to many that the defender was risked from the start of Tuesday's friendly too. Speaking to the press after the game, manager Southgate was keen to defend the decision to play Stones, insisting that there was no risk in starting the defender. \"No [it wasn't a risk to play him]. The first game [against Brazil] for him wasn't a game that was a high level in terms of intensity,\" the England boss explained. \"We've done exactly what Holland did with Virgil van Dijk tonight, what Norway did with Erling Haaland and Martin Odegaard, starting both games. Holland also started Nathan Ake again. It only ever seems to fall on us when there's a question about that. \"But of course, we're disappointed if he's got a problem. It's in the adductor area. He came in on the back of not having played for two weeks so it wasn't an overload issue. But I hate sending players back to their clubs if they're not fully fit.\" Along with Stones, Manchester City may also be without fellow defender Kyle Walker for the top of the Premier League clash with Arsenal this weekend due to an injury picked up on international duty. The veteran had been forced off during England's defeat to Brazil over the weekend.",
        "link": "https://www.90min.com/posts/gareth-southgate-defends-playing-john-stones-injury-belgium"
    },
    {
        "heading": "Lionel Messi admits he 'wasn't prepared' to leave Barcelona",
        "time": "2024-03-27T14:30:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszvpp0hweq1wztnxz.jpg",
        "content": "Lionel Messi has admitted he was \"not prepared\" to leave Barcelona when he was forced out of the club in 2021, despite agreeing a new contract to stay. The Argentine forward spent over 20 years on the books at Barca, coming through the youth system and going on to become the greatest footballer in their history. In 778 appearances in all competitions, Messi bagged a club record 672 goals, winning 10 La Liga titles, four UEFA Champions Leagues and lifted six of his Ballon d'Or gongs thanks to his remarkable performances. The footballing world was left in shock when Barcelona confirmed that, due to their financial situation, they were unable to register Messi's contract for the 2021/22 season, leading to the forward joining Paris Saint-Germain as a free agent shortly afterwards. Speaking with Big Time, Messi looked back and admitted it was a \"difficult\" situation. “The change was difficult when I went to PSG, because I was doing very well in Barcelona and I planned to stay there,\" the Inter Miami star explained. \"I was not prepared to leave, everything happened very quickly, I had to rebuild my life from one day to the next. I got to know another league, another club, a new dressing room. It was a change that we were not looking for and that is why it was difficult at first.\" Following his two-year spell at PSG, Messi wanted to re-join Barcelona during the 2023 summer transfer window, insisting he \"tried but it was not possible\". The legendary forward, however, instead opted to join MLS outfit Inter Miami due to the need for other La Blaugrana players to lower their wages at the club in order to facilitate his return to Catalunya. \"I heard it was said La Liga had accepted that everything was fine for me to return, there were still many other things that had to be done,\" Messi said last summer. \"I heard that [Barcelona] had to sell players or lower player salaries and the truth is that I didn't want to go through that.\"",
        "link": "https://www.90min.com/posts/lionel-messi-admits-wasnt-prepared-leave-barcelona"
    },
    {
        "heading": "Toni Kroos makes decision on Real Madrid future",
        "time": "2024-03-27T14:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht00fjjjwvgzrqzmwj.jpg",
        "content": "Toni Kroos is set to extend his contract with Real Madrid and stay with the Spanish giants until 2025, it has been revealed. The German midfielder's future has been a hotly-followed topic in recent weeks, with his current deal with Los Blancos due to expire at the end of the 2023/24 campaign. Having shown class is permanent during his return to the German national men's team during the March international friendlies, Kroos is now expected to prolong his journey with Madrid by signing a new extension, according to Fabrizio Romano. Kroos joined Madrid in 2014 and has since made over 450 appearances for the club in all competitions, winning four Champions League crowns and three La Liga titles among a host of other trophies. While Carlo Ancelotti is bedding in a new generation of midfielders at the Bernabeu including Jude Bellingham, Aurelien Tchouameni, Eduardo Camavinga and Federico Valverde among others, Kroos has still started 20 games in Spain's top flight. His long-time midfield partner Luka Modric has not been called upon as frequently, racking up 1161 minutes of La Liga action compared to Kroos' 1799 - only Valverde, Antonio Rudiger and Rodrygo have more. The 34-year-old recently curtailed his international retirement and produced two outstanding performances as Germany beat France and the Netherlands in friendlies building towards Euro 2024.",
        "link": "https://www.90min.com/posts/toni-kroos-makes-decision-real-madrid-future"
    },
    {
        "heading": "Jude Bellingham names the England youngster set for 'amazing future'",
        "time": "2024-03-27T13:00:10Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hsznezkx9d3bqth667.jpg",
        "content": "Jude Bellingham praised the performance of Kobbie Mainoo in England's draw with Belgium but insisted he doesn't want to put more pressure on the youngster at such a tender age. Thanks to his stunning form at club level with Manchester United, 18-year-old Mainoo earned a late call-up to the England senior squad for the March international break. Having made his debut as a substitute in the defeat to Brazil, Mainoo was afforded his first ever Three Lions start in the 2-2 draw with Belgium on Tuesday. The youngster didn't disappoint, earning a player of the match award for his stunning performance at Wembley Stadium. Speaking to the press after the game, England and Real Madrid superstar Bellingham discussed his positive first impressions of Mainoo but urged fans not to expect too much from the youngster too soon. \"He was good tonight,\" he said. \"It's difficult, and I am speaking like the old head here, but I know how hard it can be when there's a clamour and people put a lot of pressure on you. \"So I don't want to add fuel to the fire, but he's definitely a brilliant player and he's going to have an amazing future at Manchester United and hopefully for England as well.\" Mainoo will be hoping he's done enough to earn a place in Gareth Southgate's Euro 2024 squad ahead this summer's tournament. With question marks over who should partner Bellingham and Declan Rice in midfield, the 18-year-old may have forced his way into contention this March.",
        "link": "https://www.90min.com/posts/jude-bellingham-names-england-youngster-amazing-future"
    },
    {
        "heading": "Barcelona dealt transfer blow in race for Girona star - report",
        "time": "2024-03-27T20:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0pncdbpd3fvs7kgd.jpg",
        "content": "Barcelona have been dealt a significant blow in their transfer pursuit of Girona midfielder Aleix Garcia, with Premier League and Bundesliga sides set to rival the cash-strapped Catalans. Signed by Manchester City aged 18 almost a decade ago, Garcia has been building his reputation with Girona since joining the club in Spain's second tier in 2021. This has been a watershed season for the midfielder as part of an unexpected La Liga title challenge, which is only just starting to falter, bringing him to the attention of a number of interested suitors. Barcelona are targeting midfielders in the summer and Catalan-born Garcia appears on a shortlist of options alongside Joshua Kimmich, Amadou Onana and Mats Wieffer. SPORT has reported that Barca, having failed in an attempt for Garcia in January over financial constraints that would have prevented the player from being registered, will try again come June. However, there is no concrete proposal at this time and there cannot be until it is clear whether the budget will allow it. It is said that the initial contact made has been \"frozen for weeks\", which is not good for Barca when there are un-named sides in both England and Germany who pose a threat to their plans. The player himself is said to be aware of the additional interest, although his preference remains Barca. Garcia is under contract with Girona until 2026, with his release clause reported to be €20m (£17m). SPORT notes that Barca could offer players in exchange in order to lower their potential cash outlay. Garcia, now 26, might be considered an upgrade on 32-year-old Oriol Romeu, signed from Girona as a stop-gap to provide cheap midfield depth for less than €4m last summer.",
        "link": "https://www.90min.com/posts/barcelona-dealt-transfer-blow-in-race-for-girona-star-report-01ht0pg4hc07"
    },
    {
        "heading": "England goalkeeper set to miss Euro 2024 with injury",
        "time": "2024-03-27T19:00:01Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0axc03q42q3pty16.jpg",
        "content": "Crystal Palace goalkeeper Sam Johnstone is set miss Euro 2024 after being ruled out for the rest of the season due to injury. The 31-year-old was forced to leave the England squad on Sunday in order to see a specialist, and has now been ruled out for the foreseeable after having surgery on an elbow injury. Johnstone, who has made 23 appearances for his club this season, has four England caps to date. He was expected to be Jordan Pickford's understudy when the squad head to Germany in the summer. The shot-stopper has put in some impressive displays for the Selhurst Park club recently, but will now enter a recovery period that will see him sit on the sidelines for three to four months. Fellow England international Dean Henderson will replace Johnstone between the sticks at Palace. Everton's Pickford has been England's number one for a while. Despite a poor error against Belgium during recent friendlies, his position is safe. Pickford will be a trusted choice on the plane to Germany, winning 60 international caps since his debut in 2017. He became a national hero during Euro 2020, assisting the team to the final of the tournament. This year he'll be hoping to go one step further with the Three Lions by helping them to their first major silverware since 1966. Pickford's closest challenger comes in the form of Arsenal's Aaron Ramsdale, who has made just 11 appearances for his club across all competitions this season. Ramsdale has gotten used to his position on the bench, with the Gunners' summer signing David Raya winning the number one jersey under Mikel Arteta.",
        "link": "https://www.90min.com/posts/england-goalkeeper-set-to-miss-euro-2024-injury"
    },
    {
        "heading": "Man City & Lionesses legend Steph Houghton announces retirement from football",
        "time": "2024-03-27T18:35:14Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0jkz05nhfzwg1q07.jpg",
        "content": "Manchester City and former England defender Steph Houghton has announced that she will retire from football at the end of the season. Houghton has made a club record 241 appearances for City since joining in 2014 ahead of the team’s inaugural professional season. She had previously starred for Arsenal and Leeds after starting her career at Sunderland. The centre-back played 121 times for England between 2007 and 2021, captaining the Lionesses at watershed World Cups in 2015 and 2019 in which the team reached the semi-finals both times. Houghton will shortly turn 36 but has seen the last few years of her career hampered by frustrating injuries, ultimately leading the curtailment of her international career in the build-up to Euro 2022. In a statement published on social media, Houghton described it as a \"privilege\" to play for Sunderland, Leeds and Arsenal, before acknowledging the \"incredible journey\" at City. \"I hope that I leave the game in a better place then when I started,\" she said, \"…and that I have contributed in some small way to giving the girls of tomorrow a better future in football.\" City boss Gareth Taylor told the club's official website: \"Steph is – without question – an icon of the game. Although her professional career on the pitch is now coming to an end, her legacy will be felt for so many years to come. She’s paved the way for so many to thrive in the future.  \"Steph has lived and breathed football for such a long time, and she leaves it in the strongest place it has ever been – a true testament to her leadership, hard work, talent, and dedication. I feel incredibly privileged to have been able to work with her since 2020 and know her name will be written into the history books as a true footballing great.\" Houghton won the WSL twice with Arsenal in 2011 and 2012, before landing a third title with Manchester City in 2016. She also won five FA Cups and seven league cups. With City locked in a WSL title race with Chelsea, her final season could yet end on the ultimate high.",
        "link": "https://www.90min.com/posts/man-city-lionesses-legend-steph-houghton-announces-retirement"
    },
    {
        "heading": "Man Utd 'angered' by youngster's lack of appearances out on loan",
        "time": "2024-03-27T18:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht0bysd57pds42e1fm.jpg",
        "content": "Manchester United are reported to be frustrated by the lack of playing time Hannibal Mejbri has been given while on loan at Sevilla in the second half of this season. Hannibal made the short-term switch to the Spanish side during the January transfer window in the hope that more regular opportunities would aid his development. He had made ten appearances for United across all competitions in 2023/24 up to that point. But the Tunisia international came under fire from boss Quique Sanchez Flores after making his debut in a substitute in a 5-1 thrashing at the hands of Girona. It was stated Hannibal would be out of contention while he settled into his new surroundings, although he was then included on the bench for a league encounter with Osasuna the very next day after those comments were made. Even so, the 21-year-old has hardly featured, being brought on for only eight minutes against Rayo Vallecano, one minute against Valencia and going unused against Atletico Madrid, Real Madrid, Almeria and Celta Vigo. Hannibal, whose United contract runs until 2025, hasn't stepped onto the pitch at all since his sole start in Sevilla colours, a 3-2 win over Real Sociedad in early March that ended after 53 minutes. As a result, AS has reported Sevilla's use of Hannibal has \"angered\" Man Utd. Similar is said regarding Alejo Veliz, who is on loan from Tottenham and also out of favour. Sevilla have the option to make Hannibal's loan into a permanent transfer for €20m (£17m), but it seems unlikely given his lack of opportunity to establish himself in the team. United had also agreed a buy-back clause for themselves worth €35m (£30m) and a sell-on clause. Hannibal has played regularly for Tunisia since switching international allegiance from France and making his senior debut in 2021. But he asked to withdraw from the squad for the recent Africa Cup of Nations to focus on securing his immediate future amid rival interest in his services from clubs other than Sevilla.",
        "link": "https://www.90min.com/posts/man-utd-angered-youngster-lack-appearances-loan"
    },
    {
        "heading": "Endrick scores debut Bernabeu goal in Brazil's friendly draw with Spain",
        "time": "2024-03-27T17:30:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01ht08hm5jbetevakw4t.jpg",
        "content": "Endrick scored his first goal at the Bernabeu, the home of his future club Real Madrid, during Brazil's 3-3 draw with Spain on Tuesday night. Fresh from setting all sorts of records by scoring the Selecao's winner against England at Wembley on Saturday, the teenage prodigy again netted off the bench. He bagged in the 50th minute after his half-time introduction, dragging Brazil level at 2-2 after goals from Rodri, Dani Olmo and Rodrygo. A second Rodri penalty looked to have given Spain victory but Lucas Paqueta struck the equaliser from the spot in the 97th minute. It's bound to be the first of many goals at the Bernabeu for Endrick, who will join Madrid from Brazilian side Palmeiras once he turns 18 in July, and Brazil manager Dorival Junior heaped praise on the teenager after the game. He told reporters: \"He is a kid who is very promising. He has been increasing his level for a long time. He was the protagonist of the final moments of the Brazilian championship last year, playing decisive and brilliant games. We have to take care of him so that we have him on the field in the most important moments and that it continues to be decisive as he has been. \"He is a player who has a unique characteristic, which is that at every moment he has the ball at his disposal, with his positioning, mobility and sensitivity in the area, he can do damage. He is a player who, if he completes his training, can become a player who makes the difference.\" Calls for Endrick to start for Brazil at the 2024 Copa America are growing louder, with manager Dorival lacking options up front. Tottenham forward Richarlison has scored the most international goals out of players included in the most recent Selecao with 20, while both Vinicius Junior and Rodrygo are hoping to improve their below-average records at international level.",
        "link": "https://www.90min.com/posts/endrick-scores-debut-bernabeu-goal-brazil-friendly-spain"
    },
    {
        "heading": "Man City vs Arsenal injuries: Every player ruled out of Premier League title clash",
        "time": "2024-03-27T17:00:01Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/voltaxMediaLibrary/mmsport/90min_en_international_web/01ht0awefmj7p2fypafx.jpg",
        "content": "Sunday sees two Premier League title contenders square off at the Etihad Stadium when Manchester City host Arsenal. The two sides are separated by just one point ahead of the clash between third and first, though rivals Liverpool could shoot to the top of the English top flight if they beat Brighton earlier in the day. In the last direct league meeting between any of the top three this season, there are injury concerns for both Pep Guardiola and Mikel Arteta to consider. The Cityzens boss watched as a number of key performers limped out of international duty, while the Gunners are patiently awaiting news on their star winger after he was ruled out of March's friendlies. Here are all the Man City and Arsenal players ruled out of Sunday's huge clash and those facing anxious races to be fit in time. First choice goalkeeper Ederson has been missing since sustaining a leg injury in the 1-1 draw with Liverpool earlier in March, but there is optimism the Brazilian will be fit in time to replace Stefan Ortega between the sticks. It's in defence where Guardiola could be most limited in his team selection this weekend. Kyle Walker withdrew from England's friendly defeat to Brazil early on and John Stones later suffered a similar fate in the 2-2 draw with Belgium. Manuel Akanji also picked up a knock on international duty with Switzerland. While Man City's backline may be a little stretched, Guardiola was at least handed a boost with both Kevin De Bruyne and Jack Grealish pictured in training in midweek. De Bruyne pulled out of Belgium's squad due to a groin problem, having already been sidelined for four months this season, and sat out of City's clash with Newcastle United in the FA Cup before the March international break. Grealish was named on the bench for that FA Cup game and is presumed fit, though he hasn't played since late February. Matheus Nunes is yet to break free of his squad player role at the Etihad Stadium and received treatment for a knock to his foot while away on Portugal duty. There were scares over Erling Haaland's fitness after the Norwegian was pictured limping out of training with his national team. However, the giant striker started both of his country's games and should pull through to feature against Arsenal. David Raya wasn't present for Arsenal's last Premier League outing against Brentford, being ineligible to face his parent club, but played his part as the Gunners eliminated Porto from the Champions League on penalties in the last 16. Gabriel Magalhaes is hopeful of shaking off a suspected Achilles tendon injury which saw him withdraw from the Brazil squad. Jurrien Timber is close to a return but won't be rushed back after tearing his anterior cruciate ligament in August. Arsenal don't have any worries in midfield at present but are sweating over the fitness of two key attackers in Bukayo Saka and Gabriel Martinelli. Starboy Saka dropped out of the England squad after being assessed by the national team at St. George's Park, while Martinelli hasn't featured for Arsenal since being replaced in the 6-0 thumping of Sheffield United at the start of March with a suspected foot problem.",
        "link": "https://www.90min.com/posts/man-city-vs-arsenal-injuries-every-player-ruled-premier-league"
    },
    {
        "heading": "5 things England must learn from March international fixtures",
        "time": "2024-03-27T13:00:04Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszrh1ta80cr1nr8g2.jpg",
        "content": "England's final chance to prove their mettle before Euro 2024 has now come to an end as the Three Lions return to their clubs without a win under their belt. The international break started on a poor note for England, with Gareth Southgate's side losing several key players due to injury. Their first game of the break ended in a disappointing 1-0 loss at the hands of Brazil. Then, following a shuffle of the squad, Gareth Southgate's side scraped a last minute draw against Belgium on Tuesday. It seems team selection may be an issue for Southgate, who will soon be forced to submit the passport numbers of those he wants to join him in Germany. Here are five things England must learn from the March international break ahead of Euro 2024. 18-year-old Kobbie Mainoo has made only 23 appearances in his first full season at Manchester United, and now he has two senior England caps.\n\nThe teenager was a late addition to Southgate's squad, but quickly earned his place in the team after offering the answer to their midfield woes.\n\nA composed performance, Mainoo looked slick and natural against Belgium, working well with both Declan Rice and Jude Bellingham.\n\nThere is a serious case for him to be on the plane for Euro 2024 now. It seems no one knows where to play Phil Foden, and Southgate definitely doesn't have the answer to the question right now either.\n\nThe England boss seems adamant on using him in a wide role, despite his continuous struggles and lack of experience playing there. The 23-year-old has said himself he prefers to play centrally, as per his role at Manchester City.\n\nFoden was ineffective against Belgium, until he began to drift inside. Naturally, Jude Bellingham is England's number ten, but a link-up for this pair could create a mayhem in the centre for opponents to deal with. Jordan Henderson's days in the squad may be over, as the 33-year-old was unable to get a single minute on the pitch against either Brazil or Belgium.\n\nSure, he provides experience in the squad, but Henderson will struggle to earn a spot when both Kobbie Mainoo and Conor Gallagher battle for a place alongside Declan Rice.\n\nThis may mark the end of his England career. He's been arguably West Ham's best player this season, but now Jarrod Bowen has proven himself key in England's squad also.\n\nHe's a unique, direct forward that offers something different among the team's overpopulated attacking department.\n\nHe was unfortunate to score an offside goal against Belgium, as honestly he did deserve his name on the scoresheet. He's a handful on the pitch, and England will be crying out for a player like him in Germany.\n\nHope he gets extra leg room on the plane, he deserves it. We didn't see many tactics on offer this week, but we did see the use of a 4-2-3-1 system against both Brazil and Belgium.\n\nThe results didn't show it, but this formation does makes sense for some key players. It allows Jude Bellingham to push forward, while also offering central cover over England's sometimes poor defence.\n\nThe solid midfield base also allows for wide rotation, while opening up lots of passing lines and angles to play out from the back.",
        "link": "https://www.90min.com/posts/5-things-england-must-learn-march-international-fixtures"
    },
    {
        "heading": "Gareth Southgate reveals how Kobbie Mainoo breakthrough has changed England's Euro 2024 plans",
        "time": "2024-03-27T11:30:01Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszkvk4y75ztc78yfb.jpg",
        "content": "Gareth Southgate has admitted Kobbie Mainoo's stunning breakthrough at Manchester United has changed England's plans moving forward. Mainoo was a late inclusion in the England senior squad for the March international friendlies against both Brazil and Belgium, making his debut off the bench in the former before starting the latter. While Mainoo impressed in his brief cameo against Brazil, the midfielder was the star of the show in the 2-2 draw with Belgium at Wembley Stadium on Tuesday, earning the player of the match award for his efforts in the middle of the park. Speaking about the youngster's fantastic performances, Southgate hailed Mainoo's maturity and his unique skill set. He said: \"He gives us a different profile of midfield player to anything else we've got and we're really pleased with what he's done, he's adapted and adjusted brilliantly. You can't believe his age really, that he's taking it all in his stride as he has. \"He seems very mature, very calm, he knows he's making his way. \"We're absolutely delighted with what he's done, first and foremost. We know some of the core parts of that, we know who has been able to play at that level, we know who our very best players are, and the rest we've got a lot clearer picture of what people are capable of from the two games we've played.\" Speaking about what the future holds for Mainoo in the England set-up, Southgate admitted the Man Utd midfielder's form 'blew apart' the plans he has moving forward. He added: \"We're just going to see how people are when they come back into form, whether they can do that fitness-wise with their clubs. \"But there's a lot of the season still to be played with his club. I had a plan on Saturday night for Tuesday that got blown apart in 12 hours so to have a plan for something in two-and-a-half months time, at the moment, is frankly ridiculous. \"Everything that we've seen with his club, he reproduced in an England shirt which isn't always the case. Very calm, receives the ball so well under pressure, strong, so we are a little bit more open playing that way but the benefits with the ball were clear to see. \"Talking to him tactically, he seems able to take all those concepts on. A lot of young players now, with their academy education, are able to do that. You can see his comfort with the ball and receiving in tight areas.\"",
        "link": "https://www.90min.com/posts/gareth-southgate-reveals-kobbie-mainoo-breakthrough-england-euro-2024"
    },
    {
        "heading": "Harry Kane set for Tottenham reunion in pre-season friendly",
        "time": "2024-03-27T11:30:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hszpfrspg5hs017014.jpg",
        "content": "Harry Kane will return to Tottenham Hotspur with Bayern Munich for a pre-season friendly in August later this year. Kane, who is Spurs' all-time record goalscorer, left north London for the Bundesliga giants in last summer's transfer window. He bagged 280 goals in 435 appearances for departing for Bavaria for an initial £86.4m plus add-ons. Bayern will visit Tottenham Hotspur Stadium on Saturday 10 August as part of the Visit Malta Cup. Eric Dier, who also plays for the Munich side following his January switch, will also return to his former club. England captain Kane, who did not feature in either of the Three Lions' March friendlies against Brazil and Belgium due to injury, has enjoyed a record-breaking start to life at Bayern but faces the prospect of another trophy-less season. Bayern are ten points behind Bundesliga leaders Bayer Leverkusen, with their last remaining hope of silverware being the Champions League where they face Kane's old north London rivals Arsenal in the quarter-finals. Tottenham, meanwhile, are fifth in the Premier League in their first season without their former striker since 2008/09, with a return to the Champions League on the cards thanks to the expansion of UEFA's flagship competition for 2024/25. Spurs and Bayern last met competitively in the Champions League in 2019/20. Mauricio Pochettino's side were thrashed 7-2 at home before the return fixture in Germany, where the Argentine's replacement Jose Mourinho oversaw a 3-1 defeat. Bayern would go on to win the tournament after beating Paris Saint-Germain 1-0 in Lisbon. The two teams also duked it out in the 1983/84 UEFA Cup. Tottenham emerged 2-1 victors on aggregate in the third round and went on to beat Austria Memphis and Hajduk Split before triumphing over Anderlecht on penalties after the two-legged final finished all square at 2-2.",
        "link": "https://www.90min.com/posts/harry-kane-set-for-tottenham-reunion-pre-season-friendly"
    },
    {
        "heading": "Football transfer rumours: Man Utd open door to Toney; Barcelona's Haaland plan",
        "time": "2024-03-27T08:50:33Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/voltaxMediaLibrary/mmsport/90min_en_international_web/01hsze6ge5ckzpsrkax9.jpg",
        "content": "90min rounds up the latest transfer news, rumours and gossip circulating around the world... Manchester United may consider entering the race to sign Ivan Toney in their search for a new striker. Arsenal and Chelsea have been linked with the Brentford talisman, who scored his first goal for England on Tuesday night. (Fabrizio Romano) Arsenal have cooled their interest in Toney and are now focusing on Sporting CP's Viktor Gyokeres, who only joined from Coventry last summer. (TalkSPORT) During trips to watch Gyokeres, Arsenal were also impressed by the performances of centre-back Ousmane Diomande. (The Sun) Bayern Munich are willing to pay a world-record €100m fee for a defender to sign Barcelona centre-back Ronald Araujo. (MARCA - Spain) The father of Liverpool winger Luis Diaz has teased his son could move to Spain at some point in his career. (Cadena SER - Spain) Barcelona retain an interest in Erling Haaland and the Spanish giants want to make another play for the Manchester City striker in 2025. (Mundo Deportivo - Spain) Chelsea have opened talks with RB Leipzig over a deal for Spain playmaker Dani Olmo, who is seen as someone who could fill holes left by Conor Gallagher and Raheem Sterling should they depart this summer. (Football Transfers) Manchester City lead Real Madrid and Barcelona in the race to secure Joshua Kimmich, whose Bayern Munich contract expires in 2025. (Fichajes - Spain) Tottenham are weighing up a move for Al Ittihad winger Jota, who played under Ange Postecoglou at Celtic. (HITC)",
        "link": "https://www.90min.com/posts/football-transfer-rumours-man-utd-toney-barcelona-haaland"
    },
    {
        "heading": "England's best and worst players in spirited draw with Belgium",
        "time": "2024-03-27T03:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hsybq7tt5gm73wbky8.jpg",
        "content": "England showed their grit and determination on Tuesday evening, twice fighting from behind to secure a 2-2 draw with Belgium at Wembley. It may have only been an international friendly, but Jude Bellingham's stoppage-time equaliser stopped Garteh Southgate's side from falling to successive defeats on home soil following the weekend loss to Brazil. It was a largely impressive performance from England as they looked far more dangerous in the final third than on Saturday, but the Three Lions could have come away with a victory if it hadn't been for some disappointing individual errors at the back. Here are England's best and worst performers from the draw with Belgium. It's bordering on boring to say at this point, but are we sure that Kobbie Mainoo is 18 years old? The Manchester United midfielder seized the opportunity to impress on his first England start, exhibiting his maturity and defensive resilience up against the likes of Leandro Trossard and Jeremy Doku. However, it was Mainoo's attacking performance that was so impressive at Wembley. The teenager played a huge part in England's first-half equaliser with a quick turn of pace and incisive pass into Bellingham, and he continually drove forward with the ball from deep positions. If it wasn't for a smart stop from Matz Sels after the break, he could have opened his England account as well. The youngster is a special talent and may well have already guaranteed himself a spot on the plane for Euro 2024 after just two appearances. Scoring a 95th-minute equaliser should be enough to secure you player of the match, but Bellingham will have to settle for honourable mention. To be honest, it was a toss of the coin between the two young midfielders, with the Real Madrid man also mightily impressive at Wembley. He showed great composure to secure England a draw and his perfectly weighted pass helped force a first-half penalty. He was at the heart of England's best moments in the attacking third and he is the difference-maker for Southgate. Jordan Pickford has been much improved when it comes to costly individual errors and rarely puts a foot wrong in an England shirt. However, his inaccurate pass was pounced upon by Belgium just 11 minutes into the match, with the Everton stopper's attempts to keep out Youri Tielemans' subsequent 20-yard effort far from inspiring. Pickford was almost a spectator for the remainder of the game, but those are the mistakes that will prove decisive in major tournaments. A night to forget for Southgate's first-choice goalkeeper. A few of England's defensive players struggled against Belgium, despite not coming under too much pressure. Joe Gomez was poor in a rare international outing and couldn't handle Doku, but Lewis Dunk, similalry to Pickford, was guilty of handing the visitors a goal. The Brighton defender, whose passing was also a bit wayward at times, failed to deal with a routine ball in behind, stumbling and allowing Romelu Lukaku to attack the penalty area. The Roma striker, who capitalised on an eerily similar Dunk error in the Europa League several weeks ago, set up Tielemans with a magnificent cross as England went into the break behind. Centre-back remains a problem area for England with John Stones the only elite option Southgate currently possesses, and Dunk will have done himself no favours with a nervy display on Tuesday.",
        "link": "https://www.90min.com/posts/england-best-worst-players-spirited-draw-belgium"
    },
    {
        "heading": "Real Madrid's 2023/24 squad: Keep, sell, loan or release this summer",
        "time": "2024-03-27T00:00:00Z",
        "image": "https://images2.minutemediacdn.com/image/upload/images/GettyImages/mmsport/90min_en_international_web/01hsxfj8x0zpsw8x47sz.jpg",
        "content": "Let's just hope and pray all this Kylian Mbappe lark is over sharpish once the summer transfer window opens for business. Real Madrid are expected to acquire the generationally gifted Frenchman after he revealed earlier this year that he won't be extending his contract with Paris Saint-Germain. The deal appears to be a formality, but who will the 25-year-old team up with in the Spanish capital? Carlo Ancelotti's men are destined for a multi-trophy 2023/24 campaign, and we shouldn't expect drastic changes to the make-up of their squad for next season despite Mbappe's likely addition. Here's who Madrid should keep, sell, loan, and release this summer. GK: Thibaut Courtois - Regarded as the world's best goalkeeper before his injury-hit 2023/24 campaign, Courtois won't be going anywhere. GK: Andriy Lunin - The Ukrainian usurped Kepa Arrizabalaga in the depth chart this season and will fancy competing with Courtois next term. DEF: Dani Carvajal - The long-time Madridista may well retire in the Spanish capital. DEF: Eder Militao - Militao has missed much of the season due to an ACL tear, but he'll be back in time for the run-in. The Brazilian starred last term and will return as first-choice. DEF: Antonio Rudiger - The free agent arrival has been tasked with holding down the fort on his own given Madrid's centre-back injuries. A must-keep. DEF: David Alaba - Real Madrid aren't going to sell Alaba, who's out until the start of next season with a long-term knee injury. DEF: Lucas Vazquez - The versatile customer hasn't been a prominent figure, but he's still set for a contract extension before the end of the season. MID: Toni Kroos - The coolest of operators, Kroos has already been told by the club's hierarchy that he can extend his contract when he wants... and he should. MID: Eduardo Camavinga - The Frenchman has previously been linked with a move away, but Camavinga has enjoyed an uptick in minutes this term and will be a core member of Los Blancos for the next decade. MID: Aurelien Tchouameni - Who knows, perhaps Tchouameni will develop into a world-class centre-back after stepping in alongside Rudiger midway through 2023/24. He's another core member of Madrid's next generation. MID: Luka Modric - ONE MORE YEAR! ONE MORE YEAR! MID: Federico Valverde - The Uruguayan would command a monster fee having evolved into one of the world's best at his position. He's irreplaceable, and Madrid have tied him down until 2029. MID: Jude Bellingham - Now, this was a tough one... not. Belligoal will be teaming up with Mbappe entering the 2030s, probably. MID: Brahim Diaz - It looked as if Brahim's Madrid career had passed him by, but he's enjoyed a resurgent campaign while performing a bit-part role. He's a handy deputy to Jude. FWD: Vinicius Junior - Once the French superstar arrives in the Spanish capital, Madrid could arguably lay claim to the world's three best players. Vinicius has dealt with an injury setback or two this term, but he's been absolutely imperious in 2024. FWD: Rodrygo - There may be murmurs regarding a move away, but neither Mbappe nor Vinicius will want to perform Rodrygo's role. The Brazilian is key for balance, and he's a lovely player to watch. FWD: Joselu - Signed somewhat as a contingency loan last summer, Joselu has exceeded expectations and some. Madrid may well keep him on. DEF: Fran Garcia - There could be plenty of movement at left-back this summer, with Garcia, who joined the club last year, struggling to impress in year one. He might not be up to standard, but a loan is more likely than a permanent sale. MID: Arda Guler - The Turkish hotshot has endured a wretched debut season thanks to injury, and a loan is very much needed. He's not going to be getting any of Bellingham's minutes next season. DEF: Ferland Mendy - Mendy has enjoyed a decent enough season and Ancelotti would happily retain the Frenchman. However, what would be the point if Alphonso Davies joined this summer? Miguel Gutierrez could replace Garcia and the club could get a decent fee for Mendy despite his contract expiring in 2025. MID: Dani Ceballos - Madrid are not going to be able to garner a big fee for Ceballos, who's destined to join a La Liga European hopeful this summer. GK: Kepa Arrizabalaga - The loanee will not be kept on having lost his place to Lunin midway through the season. Kepa will return to Chelsea with his future once again uncertain. DEF: Nacho Fernandez - Despite being appointed captain at the start of the season, it feels as if Nacho's time with Madrid is drawing to a close with his contract expiring this summer.",
        "link": "https://www.90min.com/posts/real-madrid-2023-24-squad-keep-sell-loan-release-this-summer"
    }
]